# Creating DataFrames

In [1]:
import pandas as pd

## Series

In [2]:
data = [1,2,3,4,5]

In [7]:
s = pd.Series(data, index=["Line {}".format(i + 1) for i in range(5)])

In [8]:
s

Line 1    1
Line 2    2
Line 3    3
Line 4    4
Line 5    5
dtype: int64

In [12]:
data_dict = {
    "Line {}".format(i+1): i for i in range(5) 
}
data_dict

{'Line 1': 0, 'Line 2': 1, 'Line 3': 2, 'Line 4': 3, 'Line 5': 4}

In [13]:
s2 = pd.Series(data_dict)
s2

Line 1    0
Line 2    1
Line 3    2
Line 4    3
Line 5    4
dtype: int64

In [15]:
s3 = s2 + 1;
s3

Line 1    1
Line 2    2
Line 3    3
Line 4    4
Line 5    5
dtype: int64

In [16]:
s4 = s2 + s3
s4

Line 1    1
Line 2    3
Line 3    5
Line 4    7
Line 5    9
dtype: int64

# Concatenating DataFrames

In [18]:
dataset = [[1,2,3], [4,5,6], [7,8,9]]
dataset

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [38]:
df_1 = pd.DataFrame(dataset, 
                    index=["Line {}".format(i) for i in range(3)], 
                    columns=["Column {}".format(i) for i in range(3)])
df_1

        Column 0  Column 1  Column 2
Line 0         1         2         3
Line 1         4         5         6
Line 2         7         8         9

In [26]:
dict = {
    "Column 0": {
        "Line 0": 1,
        "Line 1": 2,
        "Line 2": 3,
    },
    "Column 1": {
        "Line 0": 4,
        "Line 1": 5,
        "Line 2": 6,
    },
    "Column 2": {
        "Line 0": 7,
        "Line 1": 8,
        "Line 2": 9,
    }
}
dict

{'Column 0': {'Line 0': 1, 'Line 1': 2, 'Line 2': 3},
 'Column 1': {'Line 0': 4, 'Line 1': 5, 'Line 2': 6},
 'Column 2': {'Line 0': 7, 'Line 1': 8, 'Line 2': 9}}

In [27]:
df_2 = pd.DataFrame(dict)
df_2

        Column 0  Column 1  Column 2
Line 0         1         4         7
Line 1         2         5         8
Line 2         3         6         9

In [28]:
dataset2 = [(1,2,3), (4,5,6), (7,8,9)]
dataset2

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [32]:
df_3 = pd.DataFrame(dataset2,
                    index=["Line {}".format(i) for i in range(3)], 
                    columns=["Column {}".format(i) for i in range(3)])
df_3

        Column 0  Column 1  Column 2
Line 0         1         2         3
Line 1         4         5         6
Line 2         7         8         9

In [39]:
df_1[df_1 > 0] = 'A'
df_1

       Column 0 Column 1 Column 2
Line 0        A        A        A
Line 1        A        A        A
Line 2        A        A        A

In [40]:
df_2[df_2 > 0] = 'B'
df_2

       Column 0 Column 1 Column 2
Line 0        B        B        B
Line 1        B        B        B
Line 2        B        B        B

In [41]:
df_3[df_3 > 0] = 'C'
df_3

       Column 0 Column 1 Column 2
Line 0        C        C        C
Line 1        C        C        C
Line 2        C        C        C

In [42]:
df_concatenated = pd.concat([df_1, df_2, df_3])
df_concatenated

       Column 0 Column 1 Column 2
Line 0        A        A        A
Line 1        A        A        A
Line 2        A        A        A
Line 0        B        B        B
Line 1        B        B        B
Line 2        B        B        B
Line 0        C        C        C
Line 1        C        C        C
Line 2        C        C        C

In [43]:
df_concatenated_axis = pd.concat([df_1, df_2, df_3], axis=1)
df_concatenated_axis

,Column 0,Column 1,Column 2,Column 0,Column 1,Column 2,Column 0,Column 1,Column 2
Line 0,A,A,A,B,B,B,C,C,C
Line 1,A,A,A,B,B,B,C,C,C
Line 2,A,A,A,B,B,B,C,C,C